app/admin/dashboard.rb

SELECT "users".* FROM "users"
---
  content title: proc { I18n.t("active_admin.dashboard") } do
    # Sezione: Tabella degli Utenti
    panel "Gestione Utenti" do
      table_for User.all do