app/controllers/admin/users_controller.rb

  def new
    @user = User.new
    @users = User.all
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)
    @users = User.all
    if @user.save
---
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "name", "role") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])
    @users = User.all
    if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "encrypted_password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "paolo@bassolegnami.com"], ["encrypted_password", "[FILTERED]"], ["updated_at", "2024-12-18 18:04:56.278324"], ["id", 2]]