app/views/admin/users.html.erb

SELECT "users".* FROM "users"
---
      <%= form.label :role, 'Ruolo' %>
      <%= form.select :role, User::ROLES, include_blank: 'Seleziona un ruolo' %>